{
    "emails": [
        {
            "id": 1,
            "from": "etudiant1@example.com",
            "subject": "Question sur les thèmes de Jane Austen",
            "date": "2023-10-01",
            "body": "Bonjour, je voulais vous poser une question concernant les thèmes principaux dans les œuvres de Jane Austen, notamment dans \"Pride and Prejudice\". Pouvez-vous m'expliquer comment les relations sociales sont dépeintes ? Merci beaucoup !"
        },
        {
            "id": 2,
            "from": "etudiant2@example.com",
            "subject": "Problème avec les intégrales",
            "date": "2023-10-02",
            "body": "Bonjour, j'ai des difficultés avec le calcul des intégrales. Pourriez-vous m'expliquer comment on résout les intégrales définies, en particulier celles qui impliquent des fonctions exponentielles ? Merci !"
        },
        {
            "id": 3,
            "from": "etudiant3@example.com",
            "subject": "Compréhension de la régression linéaire",
            "date": "2023-10-03",
            "body": "Bonjour, j'étudie la régression linéaire et j'ai du mal à comprendre comment interpréter les coefficients de régression. Pourriez-vous m'expliquer comment ils influencent le modèle prédictif ? Merci d'avance."
        },
        {
            "id": 4,
            "from": "etudiant4@example.com",
            "subject": "Demande d'éclaircissement sur les poèmes de William Wordsworth",
            "date": "2023-10-04",
            "body": "Bonjour, j'ai besoin de quelques éclaircissements sur le style de William Wordsworth, en particulier sur sa représentation de la nature. Auriez-vous des conseils pour mieux interpréter ses poèmes ? Merci pour votre aide !"
        },
        {
            "id": 5,
            "from": "etudiant5@example.com",
            "subject": "Calcul des dérivées secondes",
            "date": "2023-10-05",
            "body": "Bonjour, je suis un peu perdu avec les dérivées secondes, surtout dans les cas où la fonction est une somme de plusieurs termes. Pourriez-vous m'aider à comprendre cela ? Merci !"
        },
        {
            "id": 6,
            "from": "etudiant6@example.com",
            "subject": "Question sur les réseaux de neurones",
            "date": "2023-10-06",
            "body": "Bonjour, pourriez-vous m'expliquer comment fonctionne la rétropropagation dans un réseau de neurones ? J'ai du mal à saisir le calcul des gradients. Merci beaucoup pour votre temps."
        },
        {
            "id": 7,
            "from": "etudiant7@example.com",
            "subject": "Analyse de 'Hamlet'",
            "date": "2023-10-07",
            "body": "Bonjour, je travaille sur 'Hamlet' de Shakespeare et j'ai du mal à analyser le monologue 'To be or not to be'. Pourriez-vous m'aider à comprendre sa signification et les idées principales ? Merci beaucoup !"
        },
        {
            "id": 8,
            "from": "etudiant8@example.com",
            "subject": "Théorèmes sur les suites arithmétiques et géométriques",
            "date": "2023-10-08",
            "body": "Bonjour, j'ai des questions sur les suites arithmétiques et géométriques, en particulier sur comment démontrer certains théorèmes. Pourriez-vous m'expliquer quelques méthodes de démonstration ? Merci !"
        },
        {
            "id": 9,
            "from": "etudiant9@example.com",
            "subject": "Introduction à l'apprentissage par renforcement",
            "date": "2023-10-09",
            "body": "Bonjour, je débute dans l'apprentissage par renforcement et je trouve le concept de 'récompense' un peu confus. Pourriez-vous m'expliquer comment les récompenses influencent le comportement des modèles ? Merci pour votre aide !"
        }
    ]
}
